Revit 2024 API
EnergyAnalysisDetailModelOptions.Tier Property
 Level of computation for energy analysis model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public EnergyAnalysisDetailModelTier Tier { get; set; }
Visual Basic
Public Property Tier As EnergyAnalysisDetailModelTier
	Get
	Set
Visual C++
public:
property EnergyAnalysisDetailModelTier Tier {
	EnergyAnalysisDetailModelTier get ();
	void set (EnergyAnalysisDetailModelTier value);
}
Remarks
 The default value is EnergyAnalysisModelTier::Final.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
EnergyAnalysisDetailModelOptions Class
Autodesk.Revit.DB.Analysis Namespace